#+TITLE: MyBash
#+NAME: Mariii-23

** Code
#+begin_SRC bash
#! /usr/bin/bash

echo "Hello World"
#+end_SRC

#+RESULTS:
: Hello World

** Send some output
#+begin_SRC bash
#! /usr/bin/bash

cat << information
This is some informative text
This is another line
And this is the end
information
#+end_SRC

#+RESULTS:
| This | is   | some    | informative | text |
| This | is   | another | line        |      |
| And  | this | is      | the         | end  |

** If and else if
#+begin_SRC bash
#! /usr/bin/bash

count=10
# Condition :
if [ $count -eq 10 ] # count == 10
# if [[ $count -eq 10 ]] # This work too
then
    echo "This is true"
#if (( $count < 10 )) # count < 10
elif (( $count <= 9 )) ; then
    echo "Do Something"
else
    echo "Other something"
fi
#+end_SRC

#+RESULTS:
: This is true

** If with multiple condictions
#+begin_SRC bash
#!/usr/bin/env bash

age=10

if [ "$age" -gt 18 ] && [ "$age" -lt 40 ] ; then
 # (This works too)
# if [[ "$age" -gt 18  &&  "$age" -lt 40 ]] ; then
# if [ "$age" -gt 18  -a  "$age" -lt 40 ] ; then
    echo "Do something"
else
    echo "Other something"
fi
#+end_SRC

#+RESULTS:
: Other something

*** while
While the condiction it's true do something
+ Code
#+begin_SRC bash
#!/usr/bin/env bash

number=1

while [[ $number -lt 10 ]] ; do
    echo "$number"
    number=$(( number+1 ))
done
#+end_SRC

#+RESULTS:
| 1 |
| 2 |
| 3 |
| 4 |
| 5 |
| 6 |
| 7 |
| 8 |
| 9 |

+ Result
  #+begin_example
    1
    2
    3
    4
    5
    6
    7
    8
    9
 #+end_example

*** Anti-loop
Until the condiction is true do something
+ Code
#+begin_SRC bash
#!/usr/bin/env bash

number=1

until [[ $number -ge 10 ]] ; do
    echo "$number"
    number=$(( number+1 ))
done

#+end_SRC

#+RESULTS:
| 1 |
| 2 |
| 3 |
| 4 |
| 5 |
| 6 |
| 7 |
| 8 |
| 9 |

+ Result
 #+begin_example
    1
    2
    3
    4
    5
    6
    7
    8
    9
 #+end_example

** Expressions
#+begin_SRC bash
#!/usr/bin/env bash

# This will write the string
echo 31+23
n1=31
n2=23

echo $(expr $n1+$n2)

# This will write the result
echo $(expr $n1 + $n2)
echo $(( 31+23 ))
echo $(( 31-23 ))
echo $(( 31*23 ))
echo $(( 31/23 ))
echo $(( 31%23 ))

echo $(expr 12+20)
#+end_SRC

#+RESULTS:
| 31+23 |
| 31+23 |
|    54 |
|    54 |
|     8 |
|   713 |
|     1 |
|     8 |
| 12+20 |
* Arrays
#+begin_SRC bash
#!/usr/bin/env bash

car=('Bwn' 'Toyota' 'Honda' 'Jipe')

echo "${car[@]}"

# Print element number one
echo "${car[1]}"

# Print the number of all elements
echo "${!car[@]}"

# Print the number of elements
echo "${#car[@]}"

echo
# delete Honda
unset car[2]
echo "${car[@]}"
echo "${!car[@]}"
echo "${#car[@]}"

# Add a  new element after deletef
car[2]='Mercedes'
echo "${car[@]}"
#+end_SRC

#+RESULTS:
|    Bwn | Toyota | Honda    | Jipe |
| Toyota |        |          |      |
|      0 | 1      | 2        | 3    |
|      4 |        |          |      |
|        |        |          |      |
|    Bwn | Toyota | Jipe     |      |
|      0 | 1      | 3        |      |
|      3 |        |          |      |
|    Bwn | Toyota | Mercedes | Jipe |
** Check function
#+begin_SRC bash
#!/usr/bin/env bash

function checkF(){
    # This is a local variavel
    returnValue="I love Linux"        
}

# This is a global variavel
returnValue="I love Mac"
echo $returnValue

checkF
echo $returnValue
#+end_SRC

#+RESULTS:
| I | love | Mac   |
| I | love | Linux |
